Revit 2027 API
Element.GetValidTypes Method
Overload List
Name | Description
GetValidTypes() |  Obtains a set of types that are valid for this element.
GetValidTypes(Document, ICollection<ElementId>) |  Obtains a set of types that are valid for all given elements.
Top
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace